# Content List

01 Importing Libraries
02 Importing Dataframes
03 Merging Dataframes
04 Exporting Dataframes

# 01 Importing Libraries

In [7]:
# Import libraries
import pandas as pd
import numpy as np
import os

# 02 Importing Dataframes

In [21]:
path = r'/Users/a/Desktop/4'

In [22]:
path

'/Users/a/Desktop/4'

In [23]:
df_ords2 = pd.read_csv(os.path.join(path, 'order_prior.csv'), index_col = False)

In [24]:
path = r'/Users/a/Career Foundry/Achievement 4/02 Data/02 Prepared Data'

In [25]:
path

'/Users/a/Career Foundry/Achievement 4/02 Data/02 Prepared Data'

In [26]:
df_ords = pd.read_csv(os.path.join(path,'orders_cleaned.csv' ), index_col = False)

In [27]:
df_ords

,Unnamed: 0,Unnamed: 0.1,order_id,user_id,order_number,orders_day_of_week,time_orders,days_since_prior_order
0,1,1,2398795,1,2,3,7,15.0
1,2,2,473747,1,3,3,12,21.0
2,3,3,2254736,1,4,4,7,29.0
3,4,4,431534,1,5,4,15,28.0
4,5,5,3367565,1,6,2,7,19.0
...,...,...,...,...,...,...,...,...
3214869,3421078,3421078,2266710,206209,10,5,18,29.0
3214870,3421079,3421079,1854736,206209,11,4,10,30.0
3214871,3421080,3421080,626363,206209,12,1,12,18.0
3214872,3421081,3421081,2977660,206209,13,1,12,7.0
3214873,3421082,3421082,272231,206209,14,6,14,30.0

In [28]:
df_ords2.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [13]:
df_ords.head()

,Unnamed: 0,Unnamed: 0.1,order_id,user_id,order_number,orders_day_of_week,time_orders,days_since_prior_order
0,1,1,2398795,1,2,3,7,15.0
1,2,2,473747,1,3,3,12,21.0
2,3,3,2254736,1,4,4,7,29.0
3,4,4,431534,1,5,4,15,28.0
4,5,5,3367565,1,6,2,7,19.0

In [29]:
df_ords2.shape

(32434489, 4)

In [30]:
df_ords.shape

(3214874, 8)

# 03 Merging Dataframes

In [31]:
df_merged_large = df_ords.merge(df_ords2, on = 'order_id', how = 'outer', indicator = True)

In [32]:
df_merged_large['_merge'].value_counts()

both          30356421
right_only     2078068
left_only       206209
Name: _merge, dtype: int64

# 04 Exporting Dataframe

In [33]:
path = r'/Users/a/Career Foundry/Achievement 4/02 Data/02 Prepared Data'

In [34]:
path

'/Users/a/Career Foundry/Achievement 4/02 Data/02 Prepared Data'

In [35]:
df_merged_large.to_pickle(os.path.join(path,'orders_products_combined.pkl'))

In [36]:
df_merged_large.head()

,Unnamed: 0,Unnamed: 0.1,order_id,user_id,order_number,orders_day_of_week,time_orders,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,1.0,1.0,2398795,1.0,2.0,3.0,7.0,15.0,196.0,1.0,1.0,both
1,1.0,1.0,2398795,1.0,2.0,3.0,7.0,15.0,10258.0,2.0,0.0,both
2,1.0,1.0,2398795,1.0,2.0,3.0,7.0,15.0,12427.0,3.0,1.0,both
3,1.0,1.0,2398795,1.0,2.0,3.0,7.0,15.0,13176.0,4.0,0.0,both
4,1.0,1.0,2398795,1.0,2.0,3.0,7.0,15.0,26088.0,5.0,1.0,both